[       

    {
        "key":"1",
        "title":"Bhagwandas Goverdhandas Kedia vs. M/s Girdharilal Parshottamdas and Co.",

        "Introduction":"The case of Bhagwandas Goverdhandas Kedia vs. M/s Girdharilal Parshottamdas and Co broadened the scope of offer and acceptance communication. When the agreement was reached over the phone, this case determined the jurisdiction for launching a claim. This case addressed the problem of jurisdiction arising at the offeror's location, i.e., a location where the acceptance is heard by the offeror with instantaneous communication, as opposed to communication by post.",

        "Facts":"1. On 22nd July 1959, Bhagwandas Goverdhandas Kedia Oil Mills (defendant-appellant) agreed to supply cottonseed cakes to M/s. Girdharilal Parshottamdas and Co. (plaintiff-respondent) of Ahmedabad over a telephone.\n2. The respondents brought an action against the appellant in the City Civil Court of Ahmedabad as the appellant failed to supply seed cakes as per the agreement.3. The appellant contended that the respondents’ offer to purchase was accepted at Khamgaon and the delivery and payment of the goods were also agreed to be made in Khamgaon and the City Civil Court of Ahmedabad had no jurisdiction to try the suit.\n4. The City Civil Court of Ahmedabad held that it had jurisdiction as the acceptance of the offer was initiated in Ahmedabad and was intimidated to the offeree at Ahmedabad and that the contract was formed in Ahmedabad.\n5. The appellants filed an application in the High Court of Gujarat, which was rejected. Then, the appellants with special leave appealed to Supreme Court.",

        "Issues raised":"1. Whether the Ahmedabad Civil Court had jurisdiction over the matter?\n2. Whether the contract was formed at the place of acceptance, or where the acceptance was received?\n3. ",

        "Decision":"The judges present to hear this case were Justice Shah, Justice Wanchoo, and Justice Hidayatullah. This case was in favour of respondents with a majority of 2:1.\nJustice Shah and Justice Wanchoo were of the opinion that the majority of the European countries and the US had accepted the rule of consensus ad idem and the contract is made where the acceptance is spoken.\nThe Indian Contract Act 1872 doesn’t foresee the contracts formed through instantaneous modes of communication, such as a telephone. Therefore, Ahmedabad Civil Court had the jurisdiction to try the suit since the contract was formed where the acceptance was initiated under its territorial jurisdiction.\nJustice Hidayatullah gave a dissenting opinion, saying that though Indian Contract Act is applicable in India, it was inspired by English Contract Law. In Entores case it was held that a contract is formed only when the communication of acceptance is done and is heard by the offeror. The contract has emerged where the acceptance is received and not where spoken through telephone. Therefore, the Ahmedabad civil city court doesn’t have jurisdiction to look into the matter.\nThe Honourable Supreme Court held that the Trial Court was correct, and the decision was rightfully made under its jurisdiction where the communication of acceptance is heard by the offeror through the telephone. Therefore, the appeal made was dismissed.",

        "Conclusion":"This case broadened the scope of offer and acceptance communication. In a matter where the breach occurred, the court decided to call into question the place of origin of the cause of action. It defined the regulations for communicating offers, acceptances, and revocations over the phone. It stated that the regulation that applies when acceptance is made by mail does not apply when acceptance is made by phone. When people reach an agreement over the phone, it's like they're having a conversation in front of each other. Acceptance of the offer is thus made at the offeror's location when communication is instantaneous, i.e., through telephone."
    },

    {
        "key":"2",
        "title":"Arnesh Kumar v. State of Bihar",

        "Introduction":"The case of 'Arnesh Kumar v. State of Bihar' (2014) is a very important case in criminal law where court laid down guidelines for arresting a person. The background of the case was the matter of domestic problems when a wife filed report against husband accusing him for demanding dowry.",

        "Facts":"1. This case is a landmark case on 2 folds, firstly, on misuse of Section 498-A of Indian Penal Code, 1860(IPC) and secondly, on putting further checks and balances on power of Police to arrest without warrant.\n2. The marriage between Arnesh Kumar and Sweta Kiran was solemnized on 01/07/2007.\n3. Sweta Kiran alleged before the court that her mother-in-law and father-in-law has demanded Rupees 8 lakhs, a Maruti Car, an Air-Conditioner, Television set etc. and when this fact was brought to the Arnesh Kumar’s notice, he supported his mother and threatened to marry another woman. Further she also alleged that, she was driven out of her matrimonial home due to non-fulfilment of the demand of dowry.\n4. Arnesh Kumar denied these allegations and preferred an application for anticipatory bail which was earlier rejected by the learned Sessions Judge and thereafter by the High Court.\n5. Hence Arnesh Kumar has moved to Supreme Court by the way of Special Leave Petition.",

        "Issues Involved":"1. Whether it is necessary for a Police officer to arrest a person against a complaint if such person is suspected to commit a cognizable offence?\n2. What are the remedies available to a person, if the women misuse section 498-A, of IPC to her own advantage?\n3. Whether the appellant should be granted anticipatory bail?",

        "Judgement":"The Supreme Court granted provisional bail to the appellant on certain conditions. The Apex Court said that “Section 498-A is a cognizable and non-bailable offence has lent it a dubious place of pride amongst the provisions that are used as weapons rather than shield by disgruntled wives. The simplest way to harass is to get the husband and his relatives arrested under this provision.” The Apex Court gave some mandatory directions for Police to be followed before arresting a person to avoid unnecessary arrest of accused.",

        "Conclusion":"Every coin has two sides, the powers given to women under section 498-A of IPC not only brought advantages to women but nowadays they are being widely misused. The Court in this case not only granted bail to the accused but also cater the problem of unnecessary arrest by putting some mandatory directions that ought to be followed by the Police before arresting accused thus created some further checks and balance on power of Police as well as a relief to the people who are being harassed by false cases. As Court eloquently stated, “Arrest brings humiliation, curtails freedom and cast scars forever.” "
    }
]