[       

    {
        "key":1,
        "title":"Bhagwandas Goverdhandas Kedia vs. M/s Girdharilal Parshottamdas and Co.",

        "Introduction":"Introduction: The case of Bhagwandas Goverdhandas Kedia vs. M/s Girdharilal Parshottamdas and Co broadened the scope of offer and acceptance communication. When the agreement was reached over the phone, this case determined the jurisdiction for launching a claim. This case addressed the problem of jurisdiction arising at the offeror's location, i.e., a location where the acceptance is heard by the offeror with instantaneous communication, as opposed to communication by post.",

        "Facts":"Facts:\n 1. On 22nd July 1959, Bhagwandas Goverdhandas Kedia Oil Mills (defendant-appellant) agreed to supply cottonseed cakes to M/s. Girdharilal Parshottamdas and Co. (plaintiff-respondent) of Ahmedabad over a telephone.\n2. The respondents brought an action against the appellant in the City Civil Court of Ahmedabad as the appellant failed to supply seed cakes as per the agreement.3. The appellant contended that the respondents’ offer to purchase was accepted at Khamgaon and the delivery and payment of the goods were also agreed to be made in Khamgaon and the City Civil Court of Ahmedabad had no jurisdiction to try the suit.\n4. The City Civil Court of Ahmedabad held that it had jurisdiction as the acceptance of the offer was initiated in Ahmedabad and was intimidated to the offeree at Ahmedabad and that the contract was formed in Ahmedabad.\n5. The appellants filed an application in the High Court of Gujarat, which was rejected. Then, the appellants with special leave appealed to Supreme Court.",

        "Issues":"Issues: \n1. Whether the Ahmedabad Civil Court had jurisdiction over the matter?\n2. Whether the contract was formed at the place of acceptance, or where the acceptance was received?",

        "Decision":"Decision: The judges present to hear this case were Justice Shah, Justice Wanchoo, and Justice Hidayatullah. This case was in favour of respondents with a majority of 2:1.\nJustice Shah and Justice Wanchoo were of the opinion that the majority of the European countries and the US had accepted the rule of consensus ad idem and the contract is made where the acceptance is spoken.\nThe Indian Contract Act 1872 doesn’t foresee the contracts formed through instantaneous modes of communication, such as a telephone. Therefore, Ahmedabad Civil Court had the jurisdiction to try the suit since the contract was formed where the acceptance was initiated under its territorial jurisdiction.\nJustice Hidayatullah gave a dissenting opinion, saying that though Indian Contract Act is applicable in India, it was inspired by English Contract Law. In Entores case it was held that a contract is formed only when the communication of acceptance is done and is heard by the offeror. The contract has emerged where the acceptance is received and not where spoken through telephone. Therefore, the Ahmedabad civil city court doesn’t have jurisdiction to look into the matter.\nThe Honourable Supreme Court held that the Trial Court was correct, and the decision was rightfully made under its jurisdiction where the communication of acceptance is heard by the offeror through the telephone. Therefore, the appeal made was dismissed.",

        "Conclusion":"Conclusion: This case broadened the scope of offer and acceptance communication. In a matter where the breach occurred, the court decided to call into question the place of origin of the cause of action. It defined the regulations for communicating offers, acceptances, and revocations over the phone. It stated that the regulation that applies when acceptance is made by mail does not apply when acceptance is made by phone. When people reach an agreement over the phone, it's like they're having a conversation in front of each other. Acceptance of the offer is thus made at the offeror's location when communication is instantaneous, i.e., through telephone."
    },

    {
        "key":2,
        "title":"Arnesh Kumar v. State of Bihar",

        "Introduction":"Introduction: The case of 'Arnesh Kumar v. State of Bihar' (2014) is a very important case in criminal law where court laid down guidelines for arresting a person. The background of the case was the matter of domestic problems when a wife filed report against husband accusing him for demanding dowry.",

        "Facts":"Facts: \n1. This case is a landmark case on 2 folds, firstly, on misuse of Section 498-A of Indian Penal Code, 1860(IPC) and secondly, on putting further checks and balances on power of Police to arrest without warrant.\n2. The marriage between Arnesh Kumar and Sweta Kiran was solemnized on 01/07/2007.\n3. Sweta Kiran alleged before the court that her mother-in-law and father-in-law has demanded Rupees 8 lakhs, a Maruti Car, an Air-Conditioner, Television set etc. and when this fact was brought to the Arnesh Kumar’s notice, he supported his mother and threatened to marry another woman. Further she also alleged that, she was driven out of her matrimonial home due to non-fulfilment of the demand of dowry.\n4. Arnesh Kumar denied these allegations and preferred an application for anticipatory bail which was earlier rejected by the learned Sessions Judge and thereafter by the High Court.\n5. Hence Arnesh Kumar has moved to Supreme Court by the way of Special Leave Petition.",

        "Issues":"Issues:\n1. Whether it is necessary for a Police officer to arrest a person against a complaint if such person is suspected to commit a cognizable offence?\n2. What are the remedies available to a person, if the women misuse section 498-A, of IPC to her own advantage?\n3. Whether the appellant should be granted anticipatory bail?",

        "Judgement":"Judgement: The Supreme Court granted provisional bail to the appellant on certain conditions. The Apex Court said that “Section 498-A is a cognizable and non-bailable offence has lent it a dubious place of pride amongst the provisions that are used as weapons rather than shield by disgruntled wives. The simplest way to harass is to get the husband and his relatives arrested under this provision.” The Apex Court gave some mandatory directions for Police to be followed before arresting a person to avoid unnecessary arrest of accused.",

        "Conclusion":"Conclusion: Every coin has two sides, the powers given to women under section 498-A of IPC not only brought advantages to women but nowadays they are being widely misused. The Court in this case not only granted bail to the accused but also cater the problem of unnecessary arrest by putting some mandatory directions that ought to be followed by the Police before arresting accused thus created some further checks and balance on power of Police as well as a relief to the people who are being harassed by false cases. As Court eloquently stated, “Arrest brings humiliation, curtails freedom and cast scars forever.” "
    },
    {
        "key":3,
        "title":"CASE ANALYSIS: TMA PAI FOUNDATION VS STATE OF KARNATAKA (2002) 8 SCC 481",
        "Introduction":"Introduction: The TMA Pai Foundation case was a milestone 11 judge decision that established the parameters of regulatory standards on private institutions and continues to occupy the education area in terms of the validity of statutory provisions. Article 30[1] of Par t III of the Constitution particularly provides for the educational rights of minorities “Establish and govern educational institutions of their choice” among the many specific fundamental rights",
        "Facts":"Facts: Dr. T.M.A Pai established an academic institution called ‘The Academy of General Education,’ which was founded as an organization under the Societies Registration Act,1860[3] in Manipal, which was in the state of Madras at the time, but became a part of the state of Karnataka after the states were recog nized. The governor of the state adopted a law called the Karnataka Educational Institutions Ordinance, 1984[4] under the restriction of the capital charge to forbid the unethical collection of the fee in excessive amounts. A writ petition was filed challe nging the legitimacy of the above ntioned law and the state government’s directive dated 19.07.1984 limiting the total intake ofcollege and allocating 40% of the seats as government seats. During the time that the petition was pending, Karnataka Educati onal Institutions (Prohibition of Capitation Fee) Act,1984[5] was passed that set the rates of capitation and tuition fees for private unaided (not taking any assistance from the government) educational institutions. The college in question was classified as a private unaided educational institution because it received no financial assistance from the state government.",
        "Issues":"Issues: \n1. Is there any law allowing one to establish an d govern an educational institution?\n 2. How will religious and linguistic minorities be decided on the grounds of the state or the entire country?\n 3. Whether or not the government’s rules on minority affiliated or unaffiliated institutions violate Article 30?\n 4.As for what degree can the government place limits on minority aided and unassisted institutions’ management?",
        "Argumentsbypetitioner":"Arguments by petitioner: \n1. The petitioners argued that the Karnataka Educational Institutions (Prohibition of Capitation Fee) Act,1984 is in breach of Article 30[9] of the constitution, which allows linguistic and religious minorities the right to establish and govern their educa tional institutions.\n 2. The applicants claimed that Konkani is a minority language spoken by a small group of people in the state. TMA Pai was a Konkani speaker by birth, as per the petitioners, hence after his death, a Konkani linguistic institution was fou nded to honor his memory and promote his goals. Because Konkani is a minority language spoken in Karnataka, it is protected by Article 30 of the constitution.\n 3. As a result, private educational institutions must have total autonomy in their management, with the state refraining from interfering or imposing restrictions on nominees for private educational institutions’ governing bodies, provisions for student admission, fee structure determination, and teacher recruitment, among other things.",
        "Argumentsbyrespondents":"Arguments by respondents: \nThe state’s counsel argued that because Article 30 is not an inalienable and an absolute right, the government can put reasonable regulations and limitations on minorities’ private educational establishments in the interest of effective and equitable management. The respondents stated that the Act was passed to put an end to the practice of charging capitation fees and commercializing education. As a result, the Act’s provisions do not violate Articles 30, 14, or 19[11] of the Constitution",
        "Analysisofthejudgment":"Analysis of the judgment: \nArticle 30(1)[13] cannot act as a hindrance or disallow the government to make or frame any regulatory norms on the national interests. Limitations under article 30 should be read and understood correctly.\n The court held the minority status of any religion will be decided state wise and not nation wise. It is the fundamental right of the minorities to set up their educational institutions but these rights given to them under Article 30(1) will not be absolute. It must be read with article 29(2)[14] and also concerning all the other fundamental rights. The state can impose reasonable restrictions on such institutions. The minority institutions can admit students as per the criteria decided by them if they  are not getting a ny aid from the state. The admission process should be transparent, merit based, and fair. Merit should not be compromised even if it is an unaided minority institution. In the case of aided institutions, the state can regulate the admission process for th e forward classes. It was also    recommended that the primary criteria for admissions should be merit while keeping in mind the recommended that the primary criteria for admissions should be merit while keeping in mind the need to make special provisions for candidates of the backward classes. The admissions policy of the need to make special provisions for candidates of the backward classes. The admissions policy of the state should be redrafted andstate should be redrafted and implemented accordingly. Even the recruitment of the teaching staff implemented accordingly. Even the recruitment of the teaching staff should be fairshould be fair . Basic provisions to regulate the aforesaid things can be made by the state but the . Basic provisions to regulate the aforesaid things can be made by the state but the independence of the minority institutions should not get damaged. Fees charged by unindependence of the minority institutions should not get damaged. Fees charged by unaided aided minority institutions cannot be regulated, however it shouldn’t be higher than what is approved by minority institutions cannot be regulated, however it shouldn’t be higher than what is approved by the regulatory norms.the regulatory norms.",
        "Conclusion":"Conclusion: According to my opinion, the future impact of this verdict may be detrimental as it may give rise to a feeling of distinction and separation between the majority and minority sections of the population. This distinction may also come in matters of national interests. After such a judgment, people are more likely to focus only on the individual interests of the betterment of their communities rather than thinking about the betterment of the nation as a whole. This verdict may encourage educational institutio ns to adopt an extremely narrow mindset which could be completely contradictory to the ultimate purpose of education, i.e., to build a better society by imparting education to all irrespective of their social and religious backgrounds. These religious inst itutions may get used as a den of illegal activities or may also act as an obstacle to national security as the state has not been vigilant enough to monitor their actions"
    },
    {
        "key":5,
        "title":"Danamma v. Amar Singh",
        "Introduction":"Introduction: Gender inequality has long been a societal concern, with the consequences affecting a wide range of people in modern society. A variety of legislations and interpretations by the legislature and the judiciary have been noticed in this subject, and tireless efforts have been made to correct the inequity that exists around us.\n Legislative inconsistencies, misconstrued statutes, and inadvertently missed discriminatory legislation continue to generate widespread discomfort and disquiet. A similar interpretation of Section 6 of the Hindu Succession Act, 1956 indicated another step forward in the effort to assist persons in exercising the equality enshrined in the constitution. Using a faulty reading of this clause of the Hindu Succession Act, 1956, which answers whether daughters can be denied their share of property because they were born prior to the Act's enactment, the court declined to give the appellants in the case their due portion.\n The Honourable Supreme Court of India issued a historic decision in the case, removing ambiguity from the clause about the appellants' coparcener status. The following article goes into much information on the subject.",
        "Facts":"Facts: \n1. The appellants were the daughters of Mr Gurulingappa Savadi and Sumitrai and were amongst the four children with of Arun Kumar and Vijay (the respondents). 2. The respondents filed a suit against the appellant for the partition of property on July 01, 2002 claiming 1/15th share in the properties wherein it was contended that the respondents and the widow of Gurulingappa. 3. Savadi were in joint possession of the properties as coparceners and some other properties mentioned in the plaint were acquired out of the joint family nucleus in the name of Shri Gurulingappa Savadi.\n4. It was also pleaded that Appellants were not the coparceners in the concerned joint family as they were born before the enactment of Hindu Succession Act, 1956 (Act) and that they were married daughters and at the time of their marriage they had received gold and money and had, hence, relinquished their share.\n5. When the matter was heard in the trial court, it opined in favour of the respondents, stating that the appellants could not be coparceners as they were born prior to the enactment of the Hindu Succession Act, 1956.\n 6. The decision of the trial court was challenged in the year 2008 in the Honourable High Court wherein this view of the trial court was upheld by the High Court in the impugned judgment dated January 25, 2012 thereby confirming the decree dated August 09, 2007 passed in the suit filed for partition.\n7. Aggrieved by the same, the Appellants filed a Special Leave Petition before the Supreme Court of India under Article 136 of the Constitution.",
        "Issues":"Issues: \nThe issues involved and questions of law answered are as follows:\n 1. Whether the Appellants, daughters of Gurulingappa Savadi, could be denied their share on the ground that they were born prior to the enactment of the Act and, therefore, cannot be treated as coparceners?\n 2. Whether, with the passing of Hindu Succession (Amendment) Act, 2005, the Appellants would become coparcener “by birth” in their “own right in the same manner as the son” and are, therefore, entitled to equal share as that of a son?",
        "Judgement":"Judgement: \nThe Hon'ble Supreme Court, after giving due appreciation to the facts and legal issues involved in the case, opined that Mitakshara law has undergone tremendous amount of change and the said changes have been brought forward to address the growing need to merit equal treatment to the nearest female relatives, namely daughters of a coparcener, the bench further opines that section 6[1] of the Hindu Succession (Amendment) Act 2005 without doubt secures the decision. This status is of the same manner as the son of the propositus and provides the same rights and liabilities in the coparcener properties as she would have had if it had been son.\n Furthermore, the court decided that since the Gurulingappa Savadi, who was propositus of the concerned joint family property in the matter passed away, leaving behind two sons, two daughters, and a widow, both the Appellants would be entitled to a one-fifth share in the said property. Plaintiff (Respondent No. 1), the son of Arun Kumar (Defendant No. 1), was given a one-fifth share, which was to be divided into five shares on partition, namely between Arun Kumar, his wife, his two daughters, and son/Plaintiff (Respondent No. 1), entitling the Respondent No. 1 to a one-fifth share in the property in this matter.",
        "Conclusion":"Conclusion: Such decisions as those delivered by the learned bench of Justices A.K. Sikri and Ashok Bhushan must be made more frequently. The gender disparity in fields is astounding, with women denied privileges as basic as the title of coparcener in family property, which is a birth right for male successors. Such decisions are alarming exposes to society of the country's mainly superficial modernity.\n There is a need for legislation and the legal system to keep up with positive changes and progress in society, thus judges must provide more inclusive interpretations of the law, as seen in this case."

    } ,{
        "key":4,
        "title":"National Legal Service Authority v. Union of India Others",
        "Introduction":"Introduction: In this case, members of Transgender Community seek a legal declaration of their gender identity. Hijras/Eunuchs, who also fall in that group, claim legal status as a third gender with all legal and constitutional protection.\n The National Legal Services Authority provide free legal services to the weaker and other marginalized sections of the society has come forward to advocate their cause. Laxmi Narayan Tripathy, a Hijra highlighted the trauma undergone by Tripathi from his birth, born as a male but felt different from the boys of her age and was feminine in her ways. She faced repeated sexual harassments, molestation and sexual abuse, both within and outside the family. She was constantly abused by everyone as a ‘chakka’ and ‘hijra’. She started to dress and appear in public in women’s clothing in her late teens but she did not identify as a woman. Later, she joined the Hijra community in Mumbai. Siddarth Narrain, a Hijra, when he was in his 10th standard he realized that the only way for him is to join the Hijra community and when his family found that he was beaten by a cricket bat. Somehow, he escaped from his home and went to live with a group of Hijras. Sachin, a TG also expressed how he felt growing up, when he liked to put makeup in childhood and his parents always saw him as a girl. He used to help his mother in cooking, washing and cleaning but by seeing this his neighbors and relatives teased, mocked and scold him, which made him ashamed of himself.\n These were only few people who elaborated their life, there were a lot of people like them who faced the same abuse in everyday of life. That being a hijra, the Applicants has faced serious discrimination throughout their life because of their gender identity. It has bee n clear to the Applicant that the complete non recognition of the identity of hijras/transgender persons by the State has resulted in the violation of most of the fundamental rights guaranteed to them under the Constitution of Indi a",
        "Issues":"Issues: As is clear, these petitions essentially raise an issue of “Gender Identity”, which is the core issue. It has two facets, viz.:\n (a) Whether a person who is born as a male with predominantly female orientation (or vice-versa), has a right to get himself to be recognized as a female as per his choice moreso, when such a person after having undergone operational procedure, changes his/her sex as well;\n Whether transgender (TG), who are neither males nor females, have a right to be identified and categorized as a “third gender”?",
        "Judgment":"Judgment:\n1. Hijras, Eunuchs, apart from binary gender, be treated as “third gender” for the purpose of safeguarding their rights under Part III of our Constitution and the laws made by the Parliament and the State Legislature.\n 2. Transgender persons’ right to decide their self-identified gender is also upheld and the Centre and State Governments are directed to grant legal recognition of their gender identity such as male, female or as third gender.\n 3. We direct the Centre and the State Governments to take steps to treat them as socially and educationally backward classes of citizens and extend all kinds of reservation in cases of admission in educational institutions and for public appointments.\n4. Centre and State Governments are directed to operate separate HIV Sero-survellance Centres since Hijras/ Transgenders face several sexual health issues.\n 5. Centre and State Governments should seriously address the problems being faced by Hijras/Transgenders such as fear, shame, gender dysphoria, social pressure, depression, suicidal tendencies, social stigma, etc. and any insistence for SRS for declaring one’s gender is immoral and illegal.\n 6. Centre and State Governments should take proper measures to provide medical care to TGs in the hospitals and also provide them separate public toilets and other facilities.\n 7. Centre and State Governments should also take steps for framing various social welfare schemes for their betterment.\n 8. Centre and State Governments should take steps to create public awareness so that TGs will feel that they are also part and parcel of the social life and be not treated as untouchables.\n 9. Centre and the State Governments should also take measures to regain their respect and place in the society which once they enjoyed in our cultural and social life.",
        "Conclusion":"Conclusion: Social exclusion and discrimination on the ground of gender stating that one does not conform to the binary gender (male/female) does prevail in India. Discussion on gender identity including self-identification of gender of male/female or as transgender mostly focuses on those persons who are assigned male sex at birth, whether one talks of Hijra transgender, woman or male or male to female transgender persons, while concern voiced by those who are identified as female to male trans-sexual persons often not properly addressed. Female to male unlike Hijra/transgender persons are not quite visible in public unlike Hijra/transgender persons. They do experience violence and discrimination because of their sexual orientation or gender identity.\n Some of the common and reported problem that transgender most commonly suffer are: harassment by the police in public places, harassment at home, police entrapment, rape, discrimination, abuse in public places et.al. The other major problems that the transgender people face in their daily life are discrimination, lack of educational facilities, lack of medical facilities, homelessness, unemployment, depression, hormone pill abuse, tobacco and alcohol abuse, and problems related to marriage and adoption. Therefore, gender identification becomes very essential component which is required for enjoying civil rights by this community. It is only with this recognition that many rights attached to the sexual recognition as ‘third gender’ would be available to this community more meaningfully viz. the right to vote, the right to own property, the right to marry, the right to claim a formal identity through a passport and a ration card, a driver’s license, the right to education, employment, health so on."
    }
   
]